DocumentJournals/АР_ДокументыНачисленияИОплатыПоДоговорамАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DocumentJournal>
		<Properties>
			<Name>АР_ДокументыНачисленияИОплатыПоДоговорамАренды</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ПриходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.АР_АктСнятияПоказанийСчетчика</xr:Item>
				<xr:Item>Document.АР_НачислениеАренднойПлаты</xr:Item>
				<xr:Item>Document.АР_СчетНаАренду</xr:Item>
				<xr:Item>Document.АР_НачислениеПени</xr:Item>
				<xr:Item>Document.ПоступлениеНаРасчетныйСчет</xr:Item>
				<xr:Item>Document.СписаниеСРасчетногоСчета</xr:Item>
				<xr:Item>Document.РасходныйКассовыйОрдер</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.АР_СчетНаАренду.Attribute.Организация</xr:Item>
						<xr:Item>Document.АР_АктСнятияПоказанийСчетчика.Attribute.Организация</xr:Item>
						<xr:Item>Document.АР_НачислениеАренднойПлаты.Attribute.Организация</xr:Item>
						<xr:Item>Document.АР_НачислениеПени.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.Организация</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.Организация</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Контрагент</Name>
					<References>
						<xr:Item>Document.АР_СчетНаАренду.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.АР_АктСнятияПоказанийСчетчика.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.АР_НачислениеАренднойПлаты.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.АР_НачислениеПени.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.Контрагент</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.Контрагент</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<References>
						<xr:Item>Document.АР_СчетНаАренду.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.АР_АктСнятияПоказанийСчетчика.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.АР_НачислениеАренднойПлаты.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.АР_НачислениеПени.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.ДоговорКонтрагента</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.ДоговорКонтрагента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>СуммаДокумента</Name>
					<References>
						<xr:Item>Document.АР_СчетНаАренду.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.АР_НачислениеАренднойПлаты.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.АР_АктСнятияПоказанийСчетчика.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.АР_НачислениеПени.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.СуммаДокумента</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.СуммаДокумента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ОплатаАренды</Name>
					<References>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.АР_ОплатаАренды</xr:Item>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.АР_ОплатаАренды</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.АР_ОплатаАренды</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.АР_ОплатаАренды</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Ответственный</Name>
					<References>
						<xr:Item>Document.АР_СчетНаАренду.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.АР_АктСнятияПоказанийСчетчика.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.АР_НачислениеАренднойПлаты.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.АР_НачислениеПени.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.Ответственный</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.АР_СчетНаАренду.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.АР_АктСнятияПоказанийСчетчика.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.АР_НачислениеАренднойПлаты.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.АР_НачислениеПени.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<References>
						<xr:Item>Document.ПоступлениеНаРасчетныйСчет.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.ПриходныйКассовыйОрдер.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.РасходныйКассовыйОрдер.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.СписаниеСРасчетногоСчета.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.АР_АктСнятияПоказанийСчетчика.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.АР_НачислениеАренднойПлаты.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.АР_НачислениеПени.Attribute.РучнаяКорректировка</xr:Item>
						<xr:Item>Document.АР_СчетНаАренду.Attribute.РучнаяКорректировка</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

DocumentJournals/АР_ДокументыНачисленияИОплатыПоДоговорамАренды/Forms/ФормаСписка/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", ОтборОрганизация, ЗначениеЗаполнено(ОтборОрганизация));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Контрагент", ОтборКонтрагент, ЗначениеЗаполнено(ОтборКонтрагент));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОсновнаяОрганизация           = Справочники.Организации.ОрганизацияПоУмолчанию();
	ОтборОрганизация              = ОсновнаяОрганизация;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОтборОрганизация = ОбщегоНазначенияБПКлиент.ИзменитьОтборПоОсновнойОрганизации(Список, ,Параметр);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПровестиДокумент(ПараметрКоманды)
	
	ДокументОбъект = ПараметрКоманды.ПолучитьОбъект();
	Попытка
		Если НЕ ДокументОбъект.ПроверитьЗаполнение() Тогда 
			Возврат Ложь;
		КонецЕсли;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции

&НаСервере
Функция ПолучитьПараметрыДокумента(Ссылка)
	
	МетаданныеДокумента	= Ссылка.Метаданные();
	
	ЕстьРучнаяКорректировка	= ОбщегоНазначения.ЕстьРеквизитОбъекта("РучнаяКорректировка", МетаданныеДокумента);
	
	ИменаРеквизитов	= "Проведен, ПометкаУдаления";
	Если ЕстьРучнаяКорректировка Тогда
		ИменаРеквизитов	= ИменаРеквизитов + ", РучнаяКорректировка";
	КонецЕсли;
	
	Результат	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ИменаРеквизитов);
	Если НЕ ЕстьРучнаяКорректировка Тогда
		Результат.Вставить("РучнаяКорректировка", Ложь);
	КонецЕсли;
	
	Результат.Вставить("РегОперация",	БухгалтерскийУчетКлиентСерверПереопределяемый.ЭтоРегламентнаяОперация(Ссылка));
	Результат.Вставить("ОперацияБух",	ТипЗнч(Ссылка) = Тип("ДокументСсылка.ОперацияБух"));
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьДвиженияДокумента(Команда)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		ПараметрыДокумента = ПолучитьПараметрыДокумента(ТекДанные.Ссылка);
		
		Если НЕ ПараметрыДокумента.ПометкаУдаления И НЕ ПараметрыДокумента.ОперацияБух И
			НЕ ПараметрыДокумента.РегОперация И НЕ ПараметрыДокумента.РучнаяКорректировка И
			НЕ ПараметрыДокумента.Проведен Тогда
			
			Кнопки = Новый СписокЗначений;
			Кнопки.Вставить(0, КодВозвратаДиалога.Да, "Провести");
			Кнопки.Вставить(1, КодВозвратаДиалога.Нет, "Отмена");
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ПараметрыВыполненияКоманды", Новый Структура("Источник", ТекДанные.Ссылка));
			ДополнительныеПараметры.Вставить("ПараметрКоманды", ТекДанные.Ссылка);
			
			Оповещение = Новый ОписаниеОповещения("ВопросПередПросмотромСледуетПровестиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Перед просмотром проводок документ следует провести'"), Кнопки,, КодВозвратаДиалога.Да);
		Иначе
			ПараметрыФормы = Новый Структура("ДокументДвижений", ТекДанные.Ссылка);
			ОткрытьФорму("Обработка.КорректировкаДвижений.Форма", 
				ПараметрыФормы, 
				ЭтаФорма, 
				ТекДанные.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередПросмотромСледуетПровестиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрКоманды = ДополнительныеПараметры.ПараметрКоманды;
	ПараметрыВыполненияКоманды = ДополнительныеПараметры.ПараметрыВыполненияКоманды;
	
	ДокументПроведен = ПровестиДокумент(ПараметрКоманды);
	Если ДокументПроведен Тогда
		ОповеститьОбИзменении(ПараметрКоманды);
		Оповестить("ВыполненаЗаписьДокумента", Новый Структура("ДокументСсылка", ПараметрКоманды));
	Иначе
		Сообщить(НСтр("ru = 'Не удалось провести документ'"), СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ДокументДвижений", ПараметрКоманды);
	ОткрытьФорму("Обработка.КорректировкаДвижений.Форма", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрКоманды);

КонецПроцедуры
